package com.cndll.chgj.mvp.mode.bean.response;

import java.util.List;

/**
 * Created by kongqing on 2017/4/12.
 */

public class ResponseArea {

    /**
     * code : 1
     * data : [{"id":"2","pid":"1","name":"北京市","citys":[{"id":"500","pid":"52","name":"东城区"},{"id":"501","pid":"52","name":"西城区"},{"id":"502","pid":"52","name":"海淀区"},{"id":"503","pid":"52","name":"朝阳区"},{"id":"504","pid":"52","name":"崇文区"},{"id":"505","pid":"52","name":"宣武区"},{"id":"506","pid":"52","name":"丰台区"},{"id":"507","pid":"52","name":"石景山区"},{"id":"508","pid":"52","name":"房山区"},{"id":"509","pid":"52","name":"门头沟区"},{"id":"510","pid":"52","name":"通州区"},{"id":"511","pid":"52","name":"顺义区"},{"id":"512","pid":"52","name":"昌平区"},{"id":"513","pid":"52","name":"怀柔区"},{"id":"514","pid":"52","name":"平谷区"},{"id":"515","pid":"52","name":"大兴区"}]},{"id":"3","pid":"1","name":"安徽省","citys":[{"id":"36","pid":"3","name":"安庆"},{"id":"37","pid":"3","name":"蚌埠"},{"id":"38","pid":"3","name":"巢湖"},{"id":"39","pid":"3","name":"池州"},{"id":"40","pid":"3","name":"滁州"},{"id":"41","pid":"3","name":"阜阳"},{"id":"42","pid":"3","name":"淮北"},{"id":"43","pid":"3","name":"淮南"},{"id":"44","pid":"3","name":"黄山"},{"id":"45","pid":"3","name":"六安"},{"id":"46","pid":"3","name":"马鞍山"},{"id":"47","pid":"3","name":"宿州"},{"id":"48","pid":"3","name":"铜陵"},{"id":"49","pid":"3","name":"芜湖"},{"id":"50","pid":"3","name":"宣城"},{"id":"51","pid":"3","name":"亳州"},{"id":"3401","pid":"3","name":"合肥"}]},{"id":"4","pid":"1","name":"福建省","citys":[{"id":"53","pid":"4","name":"福州"},{"id":"54","pid":"4","name":"龙岩"},{"id":"55","pid":"4","name":"南平"},{"id":"56","pid":"4","name":"宁德"},{"id":"57","pid":"4","name":"莆田"},{"id":"58","pid":"4","name":"泉州"},{"id":"59","pid":"4","name":"三明"},{"id":"60","pid":"4","name":"厦门"},{"id":"61","pid":"4","name":"漳州"}]},{"id":"5","pid":"1","name":"甘肃省","citys":[{"id":"62","pid":"5","name":"兰州"},{"id":"63","pid":"5","name":"白银"},{"id":"64","pid":"5","name":"定西"},{"id":"65","pid":"5","name":"甘南"},{"id":"66","pid":"5","name":"嘉峪关"},{"id":"67","pid":"5","name":"金昌"},{"id":"68","pid":"5","name":"酒泉"},{"id":"69","pid":"5","name":"临夏"},{"id":"70","pid":"5","name":"陇南"},{"id":"71","pid":"5","name":"平凉"},{"id":"72","pid":"5","name":"庆阳"},{"id":"73","pid":"5","name":"天水"},{"id":"74","pid":"5","name":"武威"},{"id":"75","pid":"5","name":"张掖"}]},{"id":"6","pid":"1","name":"广东省","citys":[{"id":"76","pid":"6","name":"广州"},{"id":"77","pid":"6","name":"深圳"},{"id":"78","pid":"6","name":"潮州"},{"id":"79","pid":"6","name":"东莞"},{"id":"80","pid":"6","name":"佛山"},{"id":"81","pid":"6","name":"河源"},{"id":"82","pid":"6","name":"惠州"},{"id":"83","pid":"6","name":"江门"},{"id":"84","pid":"6","name":"揭阳"},{"id":"85","pid":"6","name":"茂名"},{"id":"86","pid":"6","name":"梅州"},{"id":"87","pid":"6","name":"清远"},{"id":"88","pid":"6","name":"汕头"},{"id":"89","pid":"6","name":"汕尾"},{"id":"90","pid":"6","name":"韶关"},{"id":"91","pid":"6","name":"阳江"},{"id":"92","pid":"6","name":"云浮"},{"id":"93","pid":"6","name":"湛江"},{"id":"94","pid":"6","name":"肇庆"},{"id":"95","pid":"6","name":"中山"},{"id":"96","pid":"6","name":"珠海"}]},{"id":"7","pid":"1","name":"广西壮族自治区","citys":[{"id":"97","pid":"7","name":"南宁"},{"id":"98","pid":"7","name":"桂林"},{"id":"99","pid":"7","name":"百色"},{"id":"100","pid":"7","name":"北海"},{"id":"101","pid":"7","name":"崇左"},{"id":"102","pid":"7","name":"防城港"},{"id":"103","pid":"7","name":"贵港"},{"id":"104","pid":"7","name":"河池"},{"id":"105","pid":"7","name":"贺州"},{"id":"106","pid":"7","name":"来宾"},{"id":"107","pid":"7","name":"柳州"},{"id":"108","pid":"7","name":"钦州"},{"id":"109","pid":"7","name":"梧州"},{"id":"110","pid":"7","name":"玉林"}]},{"id":"8","pid":"1","name":"贵州省","citys":[{"id":"111","pid":"8","name":"贵阳"},{"id":"112","pid":"8","name":"安顺"},{"id":"113","pid":"8","name":"毕节"},{"id":"114","pid":"8","name":"六盘水"},{"id":"115","pid":"8","name":"黔东南"},{"id":"116","pid":"8","name":"黔南"},{"id":"117","pid":"8","name":"黔西南"},{"id":"118","pid":"8","name":"铜仁"},{"id":"119","pid":"8","name":"遵义"}]},{"id":"9","pid":"1","name":"海南省","citys":[{"id":"120","pid":"9","name":"海口"},{"id":"121","pid":"9","name":"三亚"},{"id":"122","pid":"9","name":"白沙"},{"id":"123","pid":"9","name":"保亭"},{"id":"124","pid":"9","name":"昌江"},{"id":"125","pid":"9","name":"澄迈县"},{"id":"126","pid":"9","name":"定安县"},{"id":"127","pid":"9","name":"东方"},{"id":"128","pid":"9","name":"乐东"},{"id":"129","pid":"9","name":"临高县"},{"id":"130","pid":"9","name":"陵水"},{"id":"131","pid":"9","name":"琼海"},{"id":"132","pid":"9","name":"琼中"},{"id":"133","pid":"9","name":"屯昌县"},{"id":"134","pid":"9","name":"万宁"},{"id":"135","pid":"9","name":"文昌"},{"id":"136","pid":"9","name":"五指山"},{"id":"137","pid":"9","name":"儋州"}]},{"id":"10","pid":"1","name":"河北省","citys":[{"id":"138","pid":"10","name":"石家庄"},{"id":"139","pid":"10","name":"保定"},{"id":"140","pid":"10","name":"沧州"},{"id":"141","pid":"10","name":"承德"},{"id":"142","pid":"10","name":"邯郸"},{"id":"143","pid":"10","name":"衡水"},{"id":"144","pid":"10","name":"廊坊"},{"id":"145","pid":"10","name":"秦皇岛"},{"id":"146","pid":"10","name":"唐山"},{"id":"147","pid":"10","name":"邢台"},{"id":"148","pid":"10","name":"张家口"}]},{"id":"11","pid":"1","name":"河南省","citys":[{"id":"149","pid":"11","name":"郑州"},{"id":"150","pid":"11","name":"洛阳"},{"id":"151","pid":"11","name":"开封"},{"id":"152","pid":"11","name":"安阳"},{"id":"153","pid":"11","name":"鹤壁"},{"id":"154","pid":"11","name":"济源"},{"id":"155","pid":"11","name":"焦作"},{"id":"156","pid":"11","name":"南阳"},{"id":"157","pid":"11","name":"平顶山"},{"id":"158","pid":"11","name":"三门峡"},{"id":"159","pid":"11","name":"商丘"},{"id":"160","pid":"11","name":"新乡"},{"id":"161","pid":"11","name":"信阳"},{"id":"162","pid":"11","name":"许昌"},{"id":"163","pid":"11","name":"周口"},{"id":"164","pid":"11","name":"驻马店"},{"id":"165","pid":"11","name":"漯河"},{"id":"166","pid":"11","name":"濮阳"}]},{"id":"12","pid":"1","name":"黑龙江省","citys":[{"id":"167","pid":"12","name":"哈尔滨"},{"id":"168","pid":"12","name":"大庆"},{"id":"169","pid":"12","name":"大兴安岭"},{"id":"170","pid":"12","name":"鹤岗"},{"id":"171","pid":"12","name":"黑河"},{"id":"172","pid":"12","name":"鸡西"},{"id":"173","pid":"12","name":"佳木斯"},{"id":"174","pid":"12","name":"牡丹江"},{"id":"175","pid":"12","name":"七台河"},{"id":"176","pid":"12","name":"齐齐哈尔"},{"id":"177","pid":"12","name":"双鸭山"},{"id":"178","pid":"12","name":"绥化"},{"id":"179","pid":"12","name":"伊春"}]},{"id":"13","pid":"1","name":"湖北省","citys":[{"id":"180","pid":"13","name":"武汉"},{"id":"181","pid":"13","name":"仙桃"},{"id":"182","pid":"13","name":"鄂州"},{"id":"183","pid":"13","name":"黄冈"},{"id":"184","pid":"13","name":"黄石"},{"id":"185","pid":"13","name":"荆门"},{"id":"186","pid":"13","name":"荆州"},{"id":"187","pid":"13","name":"潜江"},{"id":"188","pid":"13","name":"神农架林区"},{"id":"189","pid":"13","name":"十堰"},{"id":"190","pid":"13","name":"随州"},{"id":"191","pid":"13","name":"天门"},{"id":"192","pid":"13","name":"咸宁"},{"id":"193","pid":"13","name":"襄樊"},{"id":"194","pid":"13","name":"孝感"},{"id":"195","pid":"13","name":"宜昌"},{"id":"196","pid":"13","name":"恩施"}]},{"id":"14","pid":"1","name":"湖南省","citys":[{"id":"197","pid":"14","name":"长沙"},{"id":"198","pid":"14","name":"张家界"},{"id":"199","pid":"14","name":"常德"},{"id":"200","pid":"14","name":"郴州"},{"id":"201","pid":"14","name":"衡阳"},{"id":"202","pid":"14","name":"怀化"},{"id":"203","pid":"14","name":"娄底"},{"id":"204","pid":"14","name":"邵阳"},{"id":"205","pid":"14","name":"湘潭"},{"id":"206","pid":"14","name":"湘西"},{"id":"207","pid":"14","name":"益阳"},{"id":"208","pid":"14","name":"永州"},{"id":"209","pid":"14","name":"岳阳"},{"id":"210","pid":"14","name":"株洲"}]},{"id":"15","pid":"1","name":"吉林省","citys":[{"id":"211","pid":"15","name":"长春"},{"id":"212","pid":"15","name":"吉林"},{"id":"213","pid":"15","name":"白城"},{"id":"214","pid":"15","name":"白山"},{"id":"215","pid":"15","name":"辽源"},{"id":"216","pid":"15","name":"四平"},{"id":"217","pid":"15","name":"松原"},{"id":"218","pid":"15","name":"通化"},{"id":"219","pid":"15","name":"延边"}]},{"id":"16","pid":"1","name":"江苏省","citys":[{"id":"220","pid":"16","name":"南京"},{"id":"221","pid":"16","name":"苏州"},{"id":"222","pid":"16","name":"无锡"},{"id":"223","pid":"16","name":"常州"},{"id":"224","pid":"16","name":"淮安"},{"id":"225","pid":"16","name":"连云港"},{"id":"226","pid":"16","name":"南通"},{"id":"227","pid":"16","name":"宿迁"},{"id":"228","pid":"16","name":"泰州"},{"id":"229","pid":"16","name":"徐州"},{"id":"230","pid":"16","name":"盐城"},{"id":"231","pid":"16","name":"扬州"},{"id":"232","pid":"16","name":"镇江"}]},{"id":"17","pid":"1","name":"江西省","citys":[{"id":"233","pid":"17","name":"南昌"},{"id":"234","pid":"17","name":"抚州"},{"id":"235","pid":"17","name":"赣州"},{"id":"236","pid":"17","name":"吉安"},{"id":"237","pid":"17","name":"景德镇"},{"id":"238","pid":"17","name":"九江"},{"id":"239","pid":"17","name":"萍乡"},{"id":"240","pid":"17","name":"上饶"},{"id":"241","pid":"17","name":"新余"},{"id":"242","pid":"17","name":"宜春"},{"id":"243","pid":"17","name":"鹰潭"}]},{"id":"18","pid":"1","name":"辽宁省","citys":[{"id":"244","pid":"18","name":"沈阳"},{"id":"245","pid":"18","name":"大连"},{"id":"246","pid":"18","name":"鞍山"},{"id":"247","pid":"18","name":"本溪"},{"id":"248","pid":"18","name":"朝阳"},{"id":"249","pid":"18","name":"丹东"},{"id":"250","pid":"18","name":"抚顺"},{"id":"251","pid":"18","name":"阜新"},{"id":"252","pid":"18","name":"葫芦岛"},{"id":"253","pid":"18","name":"锦州"},{"id":"254","pid":"18","name":"辽阳"},{"id":"255","pid":"18","name":"盘锦"},{"id":"256","pid":"18","name":"铁岭"},{"id":"257","pid":"18","name":"营口"}]},{"id":"19","pid":"1","name":"内蒙古自治区","citys":[{"id":"258","pid":"19","name":"呼和浩特"},{"id":"259","pid":"19","name":"阿拉善盟"},{"id":"260","pid":"19","name":"巴彦淖尔盟"},{"id":"261","pid":"19","name":"包头"},{"id":"262","pid":"19","name":"赤峰"},{"id":"263","pid":"19","name":"鄂尔多斯"},{"id":"264","pid":"19","name":"呼伦贝尔"},{"id":"265","pid":"19","name":"通辽"},{"id":"266","pid":"19","name":"乌海"},{"id":"267","pid":"19","name":"乌兰察布市"},{"id":"268","pid":"19","name":"锡林郭勒盟"},{"id":"269","pid":"19","name":"兴安盟"}]},{"id":"20","pid":"1","name":"宁夏回族自治区","citys":[{"id":"270","pid":"20","name":"银川"},{"id":"271","pid":"20","name":"固原"},{"id":"272","pid":"20","name":"石嘴山"},{"id":"273","pid":"20","name":"吴忠"},{"id":"274","pid":"20","name":"中卫"}]},{"id":"21","pid":"1","name":"青海省","citys":[{"id":"275","pid":"21","name":"西宁"},{"id":"276","pid":"21","name":"果洛"},{"id":"277","pid":"21","name":"海北"},{"id":"278","pid":"21","name":"海东"},{"id":"279","pid":"21","name":"海南"},{"id":"280","pid":"21","name":"海西"},{"id":"281","pid":"21","name":"黄南"},{"id":"282","pid":"21","name":"玉树"}]},{"id":"22","pid":"1","name":"山东省","citys":[{"id":"283","pid":"22","name":"济南"},{"id":"284","pid":"22","name":"青岛"},{"id":"285","pid":"22","name":"滨州"},{"id":"286","pid":"22","name":"德州"},{"id":"287","pid":"22","name":"东营"},{"id":"288","pid":"22","name":"菏泽"},{"id":"289","pid":"22","name":"济宁"},{"id":"290","pid":"22","name":"莱芜"},{"id":"291","pid":"22","name":"聊城"},{"id":"292","pid":"22","name":"临沂"},{"id":"293","pid":"22","name":"日照"},{"id":"294","pid":"22","name":"泰安"},{"id":"295","pid":"22","name":"威海"},{"id":"296","pid":"22","name":"潍坊"},{"id":"297","pid":"22","name":"烟台"},{"id":"298","pid":"22","name":"枣庄"},{"id":"299","pid":"22","name":"淄博"}]},{"id":"23","pid":"1","name":"山西省","citys":[{"id":"300","pid":"23","name":"太原"},{"id":"301","pid":"23","name":"长治"},{"id":"302","pid":"23","name":"大同"},{"id":"303","pid":"23","name":"晋城"},{"id":"304","pid":"23","name":"晋中"},{"id":"305","pid":"23","name":"临汾"},{"id":"306","pid":"23","name":"吕梁"},{"id":"307","pid":"23","name":"朔州"},{"id":"308","pid":"23","name":"忻州"},{"id":"309","pid":"23","name":"阳泉"},{"id":"310","pid":"23","name":"运城"}]},{"id":"24","pid":"1","name":"陕西省","citys":[{"id":"311","pid":"24","name":"西安"},{"id":"312","pid":"24","name":"安康"},{"id":"313","pid":"24","name":"宝鸡"},{"id":"314","pid":"24","name":"汉中"},{"id":"315","pid":"24","name":"商洛"},{"id":"316","pid":"24","name":"铜川"},{"id":"317","pid":"24","name":"渭南"},{"id":"318","pid":"24","name":"咸阳"},{"id":"319","pid":"24","name":"延安"},{"id":"320","pid":"24","name":"榆林"}]},{"id":"25","pid":"1","name":"上海市","citys":[{"id":"2703","pid":"321","name":"长宁区"},{"id":"2704","pid":"321","name":"闸北区"},{"id":"2705","pid":"321","name":"闵行区"},{"id":"2706","pid":"321","name":"徐汇区"},{"id":"2707","pid":"321","name":"浦东新区"},{"id":"2708","pid":"321","name":"杨浦区"},{"id":"2709","pid":"321","name":"普陀区"},{"id":"2710","pid":"321","name":"静安区"},{"id":"2711","pid":"321","name":"卢湾区"},{"id":"2712","pid":"321","name":"虹口区"},{"id":"2713","pid":"321","name":"黄浦区"},{"id":"2714","pid":"321","name":"南汇区"},{"id":"2715","pid":"321","name":"松江区"},{"id":"2716","pid":"321","name":"嘉定区"},{"id":"2717","pid":"321","name":"宝山区"},{"id":"2718","pid":"321","name":"青浦区"},{"id":"2719","pid":"321","name":"金山区"},{"id":"2720","pid":"321","name":"奉贤区"},{"id":"2721","pid":"321","name":"崇明县"}]},{"id":"26","pid":"1","name":"四川省","citys":[{"id":"322","pid":"26","name":"成都"},{"id":"323","pid":"26","name":"绵阳"},{"id":"324","pid":"26","name":"阿坝"},{"id":"325","pid":"26","name":"巴中"},{"id":"326","pid":"26","name":"达州"},{"id":"327","pid":"26","name":"德阳"},{"id":"328","pid":"26","name":"甘孜"},{"id":"329","pid":"26","name":"广安"},{"id":"330","pid":"26","name":"广元"},{"id":"331","pid":"26","name":"乐山"},{"id":"332","pid":"26","name":"凉山"},{"id":"333","pid":"26","name":"眉山"},{"id":"334","pid":"26","name":"南充"},{"id":"335","pid":"26","name":"内江"},{"id":"336","pid":"26","name":"攀枝花"},{"id":"337","pid":"26","name":"遂宁"},{"id":"338","pid":"26","name":"雅安"},{"id":"339","pid":"26","name":"宜宾"},{"id":"340","pid":"26","name":"资阳"},{"id":"341","pid":"26","name":"自贡"},{"id":"342","pid":"26","name":"泸州"}]},{"id":"27","pid":"1","name":"天津市","citys":[{"id":"2912","pid":"343","name":"和平区"},{"id":"2913","pid":"343","name":"河西区"},{"id":"2914","pid":"343","name":"南开区"},{"id":"2915","pid":"343","name":"河北区"},{"id":"2916","pid":"343","name":"河东区"},{"id":"2917","pid":"343","name":"红桥区"},{"id":"2918","pid":"343","name":"东丽区"},{"id":"2919","pid":"343","name":"津南区"},{"id":"2920","pid":"343","name":"西青区"},{"id":"2921","pid":"343","name":"北辰区"},{"id":"2922","pid":"343","name":"塘沽区"},{"id":"2923","pid":"343","name":"汉沽区"},{"id":"2924","pid":"343","name":"大港区"},{"id":"2925","pid":"343","name":"武清区"},{"id":"2926","pid":"343","name":"宝坻区"},{"id":"2927","pid":"343","name":"经济开发区"},{"id":"2928","pid":"343","name":"宁河县"},{"id":"2929","pid":"343","name":"静海县"},{"id":"2930","pid":"343","name":"蓟县"}]},{"id":"28","pid":"1","name":"西藏自治区","citys":[{"id":"344","pid":"28","name":"拉萨"},{"id":"345","pid":"28","name":"阿里"},{"id":"346","pid":"28","name":"昌都"},{"id":"347","pid":"28","name":"林芝"},{"id":"348","pid":"28","name":"那曲"},{"id":"349","pid":"28","name":"日喀则"},{"id":"350","pid":"28","name":"山南"}]},{"id":"29","pid":"1","name":"新疆维吾尔自治区","citys":[{"id":"351","pid":"29","name":"乌鲁木齐"},{"id":"352","pid":"29","name":"阿克苏"},{"id":"353","pid":"29","name":"阿拉尔"},{"id":"354","pid":"29","name":"巴音郭楞"},{"id":"355","pid":"29","name":"博尔塔拉"},{"id":"356","pid":"29","name":"昌吉"},{"id":"357","pid":"29","name":"哈密"},{"id":"358","pid":"29","name":"和田"},{"id":"359","pid":"29","name":"喀什"},{"id":"360","pid":"29","name":"克拉玛依"},{"id":"361","pid":"29","name":"克孜勒苏"},{"id":"362","pid":"29","name":"石河子"},{"id":"363","pid":"29","name":"图木舒克"},{"id":"364","pid":"29","name":"吐鲁番"},{"id":"365","pid":"29","name":"五家渠"},{"id":"366","pid":"29","name":"伊犁"}]},{"id":"30","pid":"1","name":"云南省","citys":[{"id":"367","pid":"30","name":"昆明"},{"id":"368","pid":"30","name":"怒江"},{"id":"369","pid":"30","name":"普洱"},{"id":"370","pid":"30","name":"丽江"},{"id":"371","pid":"30","name":"保山"},{"id":"372","pid":"30","name":"楚雄"},{"id":"373","pid":"30","name":"大理"},{"id":"374","pid":"30","name":"德宏"},{"id":"375","pid":"30","name":"迪庆"},{"id":"376","pid":"30","name":"红河"},{"id":"377","pid":"30","name":"临沧"},{"id":"378","pid":"30","name":"曲靖"},{"id":"379","pid":"30","name":"文山"},{"id":"380","pid":"30","name":"西双版纳"},{"id":"381","pid":"30","name":"玉溪"},{"id":"382","pid":"30","name":"昭通"}]},{"id":"31","pid":"1","name":"浙江省","citys":[{"id":"383","pid":"31","name":"杭州"},{"id":"384","pid":"31","name":"湖州"},{"id":"385","pid":"31","name":"嘉兴"},{"id":"386","pid":"31","name":"金华"},{"id":"387","pid":"31","name":"丽水"},{"id":"388","pid":"31","name":"宁波"},{"id":"389","pid":"31","name":"绍兴"},{"id":"390","pid":"31","name":"台州"},{"id":"391","pid":"31","name":"温州"},{"id":"392","pid":"31","name":"舟山"},{"id":"393","pid":"31","name":"衢州"}]},{"id":"32","pid":"1","name":"重庆市","citys":[{"id":"3325","pid":"394","name":"合川区"},{"id":"3326","pid":"394","name":"江津区"},{"id":"3327","pid":"394","name":"南川区"},{"id":"3328","pid":"394","name":"永川区"},{"id":"3329","pid":"394","name":"南岸区"},{"id":"3330","pid":"394","name":"渝北区"},{"id":"3331","pid":"394","name":"万盛区"},{"id":"3332","pid":"394","name":"大渡口区"},{"id":"3333","pid":"394","name":"万州区"},{"id":"3334","pid":"394","name":"北碚区"},{"id":"3335","pid":"394","name":"沙坪坝区"},{"id":"3336","pid":"394","name":"巴南区"},{"id":"3337","pid":"394","name":"涪陵区"},{"id":"3338","pid":"394","name":"江北区"},{"id":"3339","pid":"394","name":"九龙坡区"},{"id":"3340","pid":"394","name":"渝中区"},{"id":"3341","pid":"394","name":"黔江开发区"},{"id":"3342","pid":"394","name":"长寿区"},{"id":"3343","pid":"394","name":"双桥区"},{"id":"3344","pid":"394","name":"綦江县"},{"id":"3345","pid":"394","name":"潼南县"},{"id":"3346","pid":"394","name":"铜梁县"},{"id":"3347","pid":"394","name":"大足县"},{"id":"3348","pid":"394","name":"荣昌县"},{"id":"3349","pid":"394","name":"璧山县"},{"id":"3350","pid":"394","name":"垫江县"},{"id":"3351","pid":"394","name":"武隆县"},{"id":"3352","pid":"394","name":"丰都县"},{"id":"3353","pid":"394","name":"城口县"},{"id":"3354","pid":"394","name":"梁平县"},{"id":"3355","pid":"394","name":"开县"},{"id":"3356","pid":"394","name":"巫溪县"},{"id":"3357","pid":"394","name":"巫山县"},{"id":"3358","pid":"394","name":"奉节县"},{"id":"3359","pid":"394","name":"云阳县"},{"id":"3360","pid":"394","name":"忠县"},{"id":"3361","pid":"394","name":"石柱"},{"id":"3362","pid":"394","name":"彭水"},{"id":"3363","pid":"394","name":"酉阳"},{"id":"3364","pid":"394","name":"秀山"}]},{"id":"33","pid":"1","name":"香港特别行政区","citys":[{"id":"3365","pid":"395","name":"沙田区"},{"id":"3366","pid":"395","name":"东区"},{"id":"3367","pid":"395","name":"观塘区"},{"id":"3368","pid":"395","name":"黄大仙区"},{"id":"3369","pid":"395","name":"九龙城区"},{"id":"3370","pid":"395","name":"屯门区"},{"id":"3371","pid":"395","name":"葵青区"},{"id":"3372","pid":"395","name":"元朗区"},{"id":"3373","pid":"395","name":"深水埗区"},{"id":"3374","pid":"395","name":"西贡区"},{"id":"3375","pid":"395","name":"大埔区"},{"id":"3376","pid":"395","name":"湾仔区"},{"id":"3377","pid":"395","name":"油尖旺区"},{"id":"3378","pid":"395","name":"北区"},{"id":"3379","pid":"395","name":"南区"},{"id":"3380","pid":"395","name":"荃湾区"},{"id":"3381","pid":"395","name":"中西区"},{"id":"3382","pid":"395","name":"离岛区"}]},{"id":"34","pid":"1","name":"澳门特别行政区","citys":[{"id":"3383","pid":"396","name":"澳门"}]},{"id":"35","pid":"1","name":"台湾省","citys":[{"id":"3384","pid":"397","name":"台北"},{"id":"3385","pid":"397","name":"高雄"},{"id":"3386","pid":"397","name":"基隆"},{"id":"3387","pid":"397","name":"台中"},{"id":"3388","pid":"397","name":"台南"},{"id":"3389","pid":"397","name":"新竹"},{"id":"3390","pid":"397","name":"嘉义"},{"id":"3391","pid":"397","name":"宜兰县"},{"id":"3392","pid":"397","name":"桃园县"},{"id":"3393","pid":"397","name":"苗栗县"},{"id":"3394","pid":"397","name":"彰化县"},{"id":"3395","pid":"397","name":"南投县"},{"id":"3396","pid":"397","name":"云林县"},{"id":"3397","pid":"397","name":"屏东县"},{"id":"3398","pid":"397","name":"台东县"},{"id":"3399","pid":"397","name":"花莲县"},{"id":"3400","pid":"397","name":"澎湖县"}]}]
     * extra : 获取成功
     */

    private int code;
    private String extra;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getExtra() {
        return extra;
    }

    public void setExtra(String extra) {
        this.extra = extra;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * id : 2
         * pid : 1
         * name : 北京市
         * citys : [{"id":"500","pid":"52","name":"东城区"},{"id":"501","pid":"52","name":"西城区"},{"id":"502","pid":"52","name":"海淀区"},{"id":"503","pid":"52","name":"朝阳区"},{"id":"504","pid":"52","name":"崇文区"},{"id":"505","pid":"52","name":"宣武区"},{"id":"506","pid":"52","name":"丰台区"},{"id":"507","pid":"52","name":"石景山区"},{"id":"508","pid":"52","name":"房山区"},{"id":"509","pid":"52","name":"门头沟区"},{"id":"510","pid":"52","name":"通州区"},{"id":"511","pid":"52","name":"顺义区"},{"id":"512","pid":"52","name":"昌平区"},{"id":"513","pid":"52","name":"怀柔区"},{"id":"514","pid":"52","name":"平谷区"},{"id":"515","pid":"52","name":"大兴区"}]
         */

        private String id;
        private String pid;
        private String name;
        private List<CitysBean> citys;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getPid() {
            return pid;
        }

        public void setPid(String pid) {
            this.pid = pid;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public List<CitysBean> getCitys() {
            return citys;
        }

        public void setCitys(List<CitysBean> citys) {
            this.citys = citys;
        }

        public static class CitysBean {
            /**
             * id : 500
             * pid : 52
             * name : 东城区
             */

            private String id;
            private String pid;
            private String name;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getPid() {
                return pid;
            }

            public void setPid(String pid) {
                this.pid = pid;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }
        }
    }
}
